tutorials/myLusgsFoam/ercoftacCentrifugalPump_DyM/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    INLET
    {
      type            flowRateInletVelocity;
      massFlowRate 0.3473;
      value $internalField;
    }
    OUTLET
    {
        type            zeroGradient;
    }
    STATOR
    {
        type            empty;
    }
    BLADE_ROT
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);    
    }
    BLADE_STAT
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    AMI_INT
    {
	type		cyclicAMI;
    }
    AMI_EXT
    {
	type		cyclicAMI;
    }
    HUB_SHROUD
    {
	type		empty;
    }
}
// ************************************************************************* //
